<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"568bb11f0fb2a7ebedefd26b2aa82b8132e9ad139f294683c82b98d6fe1c0e6a","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #814 at https://github.com/cal-itp/data-infra/actions/runs/18605652497","plan_out_hash":"9b5a313af9312a998228df6f8d7f53a7d5fbc0495ecc227275f4f8a649da24c3","plan_hash":"9fdcaf5921d6db71875d91427762667c3f1221c6ec10867cbb2b29090731a3a5","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 7 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["dags/airtable_loader_v2/generate_gtfs_download_configs.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "LLSRKg==" -> (known after apply)
!~      detect_md5hash      = "WEFwfVbJm4J6LdTF0abD2A==" -> "different hash"
!~      generation          = 1751416672748889 -> (known after apply)
        id                  = "calitp-composer-dags/airtable_loader_v2/generate_gtfs_download_configs.py"
!~      md5hash             = "WEFwfVbJm4J6LdTF0abD2A==" -> (known after apply)
        name                = "dags/airtable_loader_v2/generate_gtfs_download_configs.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/dags.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "tQl0DA==" -> (known after apply)
!~      detect_md5hash      = "B95K3uhC41c6uMX4cvS/GA==" -> "different hash"
!~      generation          = 1757464207493746 -> (known after apply)
        id                  = "calitp-composer-dags/dags.py"
!~      md5hash             = "B95K3uhC41c6uMX4cvS/GA==" -> (known after apply)
        name                = "dags/dags.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["plugins/operators/external_table.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "5tuxKg==" -> (known after apply)
!~      detect_md5hash      = "xi/tINiysz98MzBL0mOvFg==" -> "different hash"
!~      generation          = 1751416674508548 -> (known after apply)
        id                  = "calitp-composer-plugins/operators/external_table.py"
!~      md5hash             = "xi/tINiysz98MzBL0mOvFg==" -> (known after apply)
        name                = "plugins/operators/external_table.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["plugins/scripts/gtfs_rt_parser.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "qYETHA==" -> (known after apply)
!~      detect_md5hash      = "1sRWG9gMSF57EIUYXiLLHw==" -> "different hash"
!~      generation          = 1759360707524627 -> (known after apply)
        id                  = "calitp-composer-plugins/scripts/gtfs_rt_parser.py"
!~      md5hash             = "1sRWG9gMSF57EIUYXiLLHw==" -> (known after apply)
        name                = "plugins/scripts/gtfs_rt_parser.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "DjRQSg==" -> (known after apply)
!~      detect_md5hash      = "nmCpPb8hpvmODl5nzYZdgw==" -> "different hash"
!~      generation          = 1760652964804161 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "nmCpPb8hpvmODl5nzYZdgw==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["seeds/transit_facilities_to_csv.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "zjpyeA==" -> (known after apply)
!~      detect_md5hash      = "bX1yRaWCcgHbVgiOxpWe7A==" -> "different hash"
!~      generation          = 1752188818455782 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/seeds/transit_facilities_to_csv.py"
!~      md5hash             = "bX1yRaWCcgHbVgiOxpWe7A==" -> (known after apply)
        name                = "data/warehouse/seeds/transit_facilities_to_csv.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "ifexaA==" -> (known after apply)
!~      detect_md5hash      = "Hp6bShBq6+PWspFRO1Ytyg==" -> "different hash"
!~      generation          = 1760652966565768 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "Hp6bShBq6+PWspFRO1Ytyg==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 7 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #814](https://github.com/cal-itp/data-infra/actions/runs/18605652497)